app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "제목"], ["description", "내용\r\n"], ["created_at", "2021-12-19 19:19:08.229314"], ["updated_at", "2021-12-19 19:19:08.229314"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save