app/controllers/comments_controller.rb

	def create
		@blog = Blog.find(params[:blog_id])
		@comment = @blog.comments.create(comment_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "fd"], ["blog_id", 2], ["created_at", "2021-12-20 03:35:33.183199"], ["updated_at", "2021-12-20 03:35:33.183199"]]

	def destroy
		@blog = Blog.find(params[:blog_id])
		@comment = @blog.comments.find(params[:id])
		@comment.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."blog_id" = ? AND "comments"."id" = ? LIMIT ?  [["blog_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]